#include <intrins.h>
#include "c51tangsang.h"

//定时器实现秒表功能
//1.利用lcd1602动态显示
//2.用独立按键1实现启动并显示秒表界面
//3.用独立按键2实现开始计时功能，再次按下独立按键2可暂停
//4.用独立按键3实现结束计时，并将计时器置零，
//5.用独立按键4实现推出计时器功能
//6.推出计时器后显示hello字样，在启动时显示hello字样

int main()
{
	//初始化外部中断3，2



    time_0_ms_init();
    //启动定时器0;
	

	while(1)
	{
		
	}
}
void time_inter() interrupt 1
{
    uchar s=0,m=0,h=0;
    uint ms=0;
    TH0=64535/256;//高八位数据     晶振12mhz，一个周期为1us，最大65535us，
    TL0=64535%256;//低八位数据->64535 = 65535-1000; -> 1000us=1ms; 定时器单位为1ms
    ms++;
    if(s==1000)
    {
        ms=0;
        s++;
        if(s==60)
        {
           s=0;
           m++;
           if(m=60)
           {
               m=0;
               h++;
           }
        }
    }
}
